УправлениеДомашнимиРасходами/src/Documents/ПокупкаУслуг/ПокупкаУслуг.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ПокупкаУслуг</name>
  <attributes>
    <name>Основание</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СуммаДокумента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Услуги</name>
    <attributes>
      <name>Услуга</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>ЕдиницаИзмерения</name>
      <type>
        <types>CatalogRef.ЕдиницыИзмерения</types>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

УправлениеДомашнимиРасходами/src/Enums/ВидНоменклатуры/ВидНоменклатуры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидНоменклатуры</name>
  <enumValues>
    <name>Товар</name>
  </enumValues>
  <enumValues>
    <name>Услуга</name>
  </enumValues>
  <enumValues>
    <name>КоммунальныеПлатежи</name>
  </enumValues>
</mdclass:Enum>

УправлениеДомашнимиРасходами/src/Catalogs/Номенклатура/Номенклатура.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Номенклатура</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>ВидНоменклатуры</name>
    <type>
      <types>EnumRef.ВидНоменклатуры</types>
    </type>
  </attributes>
  <attributes>
    <name>ЕдиницаИзмерения</name>
    <type>
      <types>CatalogRef.ЕдиницыИзмерения</types>
    </type>
  </attributes>
</mdclass:Catalog>

УправлениеДомашнимиРасходами/src/Documents/ПокупкаУслуг/Forms/ФормаДокумента/Module.bsl
#Область ОписаниеПеременных

#КонецОбласти

#Область ОбработчикиСобытийФормы
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ЭтотОбъект.ПВидНоменклатуры = Перечисления.ВидНоменклатуры.Услуга;
КонецПроцедуры
#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

// Код процедур и функций

#КонецОбласти
#Область ОбработчикиСобытийЭлементовТаблицыФормыУслуги

&НаКлиенте
Процедура УслугиУслугаОбработкаВыбора(Элемент, ВыбранноеЗначение, ДополнительныеДанные, ВыборДобавлением, СтандартнаяОбработка)
	ТекущиеДанные = Элементы.Услуги.ТекущиеДанные;
	Для Каждого строка из Объект.Услуги Цикл
		Если  строка.Услуга = ВыбранноеЗначение Тогда 
			Сообщение = Новый СообщениеПользователю();
			Сообщение.Текст = "Услуга с таким наименованием уже в списке!";
			Сообщение.УстановитьДанные(строка);
			Сообщение.Поле("Услуга");
			Сообщение.Сообщить();
			Возврат;
		КонецЕсли;
	КонецЦикла;
	ТекущиеДанные.ЕдиницаИзмерения = ОбщийМодульПокупкиВызовСервера.ПолучитьЕд_измПоСсылкеНаТовар(ВыбранноеЗначение);

КонецПроцедуры

&НаКлиенте
Процедура УслугиУслугаНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
		СтандартнаяОбработка = Ложь;
		ЗначениеОтбора =  Новый Структура("Ссылка",ОбщийМодульПокупкиВызовСервера.НоменклатураПоВиду(ПВидНоменклатуры));
		ПараметраФормы  = Новый Структура("Отбор",ЗначениеОтбора);
		ОткрытьФорму("Справочник.Номенклатура.ФормаВыбора",ПараметраФормы,Элемент);
	
КонецПроцедуры

&НаКлиенте
Процедура УслугиУслугаАвтоПодбор(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, Ожидание, СтандартнаяОбработка)
	СтандартнаяОбработка= Ложь;
	Если СтрДлина(Текст)>2 Тогда
		 	ДанныеВыбора = Новый СписокЗначений();
		 	СписокУслуг = ОбщийМодульПокупкиВызовСервера.НоменклатураПоВиду(ПВидНоменклатуры,"%"+Текст+"%" );
		 	ДанныеВыбора.ЗагрузитьЗначения(СписокУслуг);
	КонецЕсли;

КонецПроцедуры
#КонецОбласти

#Область ОбработчикиКомандФормы

// Код процедур и функций

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Код процедур и функций

#КонецОбласти
